tap "2mol/tools"
tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "openresty/brew"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# News and email agent
brew "alpine"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Message bus system, providing inter-application communication
brew "dbus"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# (Arguably) the best yacc variant
brew "byacc"
# Asynchronous DNS library
brew "c-ares"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cisco Discovery Protocol Reporter
brew "cdpr"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Implementation of the Chez Scheme language
brew "chezscheme"
# Compiler for the Scheme programming language
brew "chicken"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Dynamic, general-purpose programming language
brew "clojure"
# Common Lisp implementation with a long history
brew "clozure-cl"
# Cross-platform make
brew "cmake"
# Strongly specified, highly compatible implementation of Markdown
brew "cmark"
# High performance code minimap generator
brew "code-minimap"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# GNU diction and style
brew "diction"
# Image manipulation library
brew "jpeg"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU multiple precision arithmetic library
brew "gmp"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Run arbitrary commands when files change
brew "entr"
# Graphics library to dynamically manipulate images
brew "gd"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Postgres C API library
brew "libpq"
# Simple entity relation (ER) diagrams generation
brew "eralchemy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Libpcap-based NetFlow probe
brew "fprobe"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# R7RS Scheme implementation, developed to be a handy script interpreter
brew "gauche"
# GNU database manager
brew "gdbm"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# YAML Parser
brew "libyaml"
# Opinionated dialect of Scheme designed for Systems Programming
brew "gerbil-scheme"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Implementation of the ANS Forth language
brew "gforth"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Ruby client and CLI for GitLab API
brew "gitlab-gem"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library for handling page faults in user mode
brew "libsigsegv"
# Implementation of the Smalltalk language
brew "gnu-smalltalk"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Tag generator for Go, compatible with ctags
brew "gotags"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Kubernetes package manager
brew "helm"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool to report network interface bandwidth
brew "ifstat"
# String tool
brew "intltool"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# JSON parser for C
brew "json-c"
# Run local Kubernetes cluster in Docker
brew "kind"
# Build tool for Clojure
brew "leiningen"
# Layer Four Traceroute (LFT), an advanced traceroute tool
brew "lft"
# Sophisticated file transfer program
brew "lftp"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Portable low-level networking library
brew "libdnet"
# Library for USB device access
brew "libusb-compat"
# C virtualization API
brew "libvirt"
# C XSLT library for GNOME
brew "libxslt"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# UNIX manpage compiler toolset
brew "mandoc"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Recursively compute digests on files/directories
brew "md5deep"
# Terminal-based visual file manager
brew "midnight-commander"
# Free, open source voxel game engine and game
brew "minetest"
# Menu-driven communications program
brew "minicom"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# HTTP and WebDAV client library with a C interface
brew "neon"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Tools to collect and process netflow data on the command-line
brew "nfdump"
# Port scanning utility for large networks
brew "nmap"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Display the PID number for a given process name
brew "pidof"
# Draw UML diagrams
brew "plantuml"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Autonomous mail processor
brew "procmail"
# GNU Portable THreads
brew "pth"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Tools to work with human-editable, plain text data files
brew "recutils"
# Sophisticated calendar and alarm
brew "remind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.0"
# Scheme byte-code interpreter
brew "scheme48"
# Blazing-fast modern Lua linter
brew "selene"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# SMART hard drive monitoring
brew "smartmontools"
# Typography prettifier
brew "smartypants"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# SSL tunneling program
brew "stunnel"
# TCP connect to the given IP/port combo
brew "tcping"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Use ViM as PAGER
brew "vimpager"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Fetch summaries from MediaWiki wikis, like Wikipedia
brew "wiki"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another Dotfiles Manager
brew "yadm"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Small .pdf management utility
brew "2mol/tools/pboy"
# Scalable Web Platform by Extending NGINX with Lua
brew "openresty/brew/openresty"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Tool to turn any web page into a desktop app
cask "flotato"
cask "font-3270"
cask "font-iosevka"
# Notes manager
cask "fsnotes"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open-source video transcoder
cask "handbrake"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Vector graphics editor
cask "inkscape"
# Play music online with friends
cask "jamulus"
# End-to-end encryption software
cask "keybase"
# 2D game framework for Lua
cask "love"
# Open-source Markdown editor
cask "macdown"
# Text editor
cask "macvim"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# First-person shooter, first in a trilogy
cask "marathon"
# First-person shooter, third in a trilogy
cask "marathon-infinity"
# Visual diff and merge tool
cask "meld"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Wallet for the Monero cryptocurrency
cask "mymonero"
# Music production for 32 bit iOS devices
cask "nanostudio"
# Learn about the earth, solar system, universe and the spacecraft exploring them
cask "nasas-eyes"
# Note taking app
cask "nvalt"
# Retro video game emulation
cask "openemu"
# Replacement for Docker Desktop
cask "orbstack"
# File system integration
cask "osxfuse"
# Visual programming language for multimedia
cask "pd"
# Desktop chat client for Slack (and Discord)
cask "ripcord"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Modular synthesiser
cask "sunvox"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Development environment
cask "vagrant"
# Open-source virtual modular synthesiser
cask "vcv-rack"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Screen savers
cask "xscreensaver"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Audulus 4", id: 1592022030
mas "Balance Lock", id: 1019371109
mas "Calca", id: 635758264
mas "Exporter", id: 1099120373
mas "GarageBand", id: 682658836
mas "Graphic", id: 404705039
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "OP-Z", id: 1098190457
mas "Oscilloppoi", id: 1102313524
mas "Pages", id: 409201541
mas "Paper", id: 1143513744
mas "Pixelmator", id: 407963104
mas "Save to Reader", id: 1640236961
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
mas "Tomato 2", id: 1494210770
mas "Tomato One", id: 907364780
mas "ToothFairy", id: 1191449274
mas "WiFi Explorer", id: 494803304
