tap "2mol/tools"
tap "apparition47/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"
# News and email agent
brew "alpine"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Security-oriented static analyser for Python code
brew "bandit"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Cross-platform make
brew "cmake"
# Strongly specified, highly compatible implementation of Markdown
brew "cmark"
# High performance code minimap generator
brew "code-minimap"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# GNU diction and style
brew "diction"
# Tool for exploring each layer in a docker image
brew "dive"
# OpenType text shaping engine
brew "harfbuzz"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Minify and secure Docker images
brew "docker-slim"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# Run arbitrary commands when files change
brew "entr"
# AST-based pattern checker for JavaScript
brew "eslint"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tag generator for Go, compatible with ctags
brew "gotags"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Convert HCL2 to JSON
brew "hcl2json"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Tool to report network interface bandwidth
brew "ifstat"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Layer Four Traceroute (LFT), an advanced traceroute tool
brew "lft"
# Sophisticated file transfer program
brew "lftp"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Swiss Army Knife for macOS
brew "m-cli"
# GUI for vim, made for macOS
brew "macvim", link: false
# UNIX manpage compiler toolset
brew "mandoc"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Recursively compute digests on files/directories
brew "md5deep"
# Terminal-based visual file manager
brew "midnight-commander"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client@8.4"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql@8.4"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Display the PID number for a given process name
brew "pidof"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@15"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Autonomous mail processor
brew "procmail"
# It's not just a linter that annoys you!
brew "pylint"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Tools to work with human-editable, plain text data files
brew "recutils"
# Persistent key-value database, with built-in net interface
brew "redis"
# Sophisticated calendar and alarm
brew "remind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Typography prettifier
brew "smartypants"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# SSL tunneling program
brew "stunnel"
# TCP connect to the given IP/port combo
brew "tcping"
# Replay saved tcpdump files at arbitrary speeds
brew "tcpreplay"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terraform Language Server
brew "terraform-ls"
# Language Server Protocol for Terraform
brew "terraform-lsp"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Maintained ctags implementation
brew "universal-ctags"
# Use ViM as PAGER
brew "vimpager"
# Vim script Language Lint
brew "vint"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# Formatter for python code
brew "yapf"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Small .pdf management utility
brew "2mol/tools/pboy"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# API documentation browser and code snippet manager
cask "dash"
# Universal database tool and SQL client
cask "dbeaver-community"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
cask "font-3270"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
# Notes manager
cask "fsnotes"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Java IDE by JetBrains
cask "intellij-idea"
# Text editor
cask "macvim"
# Visual diff and merge tool
cask "meld"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Note taking app
cask "nvalt"
# Replacement for Docker Desktop
cask "orbstack"
# MySQL/MariaDB database management
cask "sequel-ace"
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Network protocol analyzer
cask "wireshark"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Screen savers
cask "xscreensaver"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keeper for Safari", id: 6444685332
mas "Keeper Password Manager", id: 414781829
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paper", id: 1143513744
mas "Save to Reader", id: 1640236961
mas "Slack", id: 803453959
mas "Tomato 2", id: 1494210770
