brew "2mol/tools/pboy"
brew "act"
brew "alpine"
brew "arping"
brew "asciidoc"
brew "awscli"
brew "ccat"
brew "certbot"
brew "cmake"
brew "cmark"
brew "code-minimap"
brew "dhcpdump"
brew "diction"
brew "dive"
brew "djvu2pdf"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "docker-slim"
brew "docutils"
brew "dos2unix"
brew "entr"
brew "flake8"
brew "fping"
brew "fzf"
brew "geoip"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitlab-runner"
brew "gnupg"
brew "go"
brew "gotags"
brew "graphviz"
brew "hadolint"
brew "harfbuzz"
brew "helm"
brew "hping"
brew "httpie"
brew "httping"
brew "ifstat"
brew "iperf3"
brew "ipython"
brew "jq"
brew "kind"
brew "lft"
brew "lftp"
brew "lldpd"
brew "m-cli"
brew "macvim", link: false
brew "mandoc"
brew "markdown"
brew "mas"
brew "masscan"
brew "md5deep"
brew "mtr"
brew "mypy"
brew "mysql-client"
brew "ncdu"
brew "nmap"
brew "openjdk@11"
brew "pandoc"
brew "parallel"
brew "pidof"
brew "pinentry"
brew "prettier"
brew "procmail"
brew "protobuf"
brew "ranger"
brew "rclone"
brew "recutils"
brew "remind"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "sf-pwgen"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "smartypants"
brew "source-highlight"
brew "sshuttle"
brew "sslscan"
brew "stunnel"
brew "tcping"
brew "tcpreplay"
brew "tcptraceroute"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "unixodbc"
brew "vimpager"
brew "virtualenv"
brew "w3m"
brew "watch"
brew "webp"
brew "wget"
brew "wireshark", link: false
cask "1password"
cask "dash"
cask "devdocs"
cask "docker"
cask "drawio"
cask "firefox"
cask "font-3270"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "fsnotes"
cask "github"
cask "google-chrome"
cask "intellij-idea"
cask "lofi"
cask "macdown"
cask "macvim"
cask "mailtrackerblocker"
cask "meld"
cask "menumeters"
cask "mesasqlite"
cask "microsoft-teams"
cask "notion"
cask "nvalt"
cask "ripcord"
cask "sequel-ace"
cask "slack"
cask "snowflake-snowsql"
cask "spotify"
cask "temurin8"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
cask "xscreensaver"
cask "zoom"
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
tap "2mol/tools"
tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"
