tap "2mol/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"
cask "osxfuse"
cask "xquartz"
brew "adns"
brew "libpng"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "libffi"
brew "openssl@1.1"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "jpeg"
brew "gdk-pixbuf"
brew "graphite2"
brew "pkg-config"
brew "gobject-introspection"
brew "icu4c"
brew "harfbuzz"
brew "libcroco"
brew "librsvg"
brew "adwaita-icon-theme"
brew "alpine"
brew "ant"
brew "libnet"
brew "arping"
brew "source-highlight"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "awscli"
brew "byacc"
brew "c-ares"
brew "ccat"
brew "cdpr"
brew "dialog"
brew "certbot"
brew "chezscheme"
brew "chicken"
brew "rlwrap"
brew "clojure"
brew "clozure-cl"
brew "cmake"
brew "cmark"
brew "dbus"
brew "dhcpdump"
brew "diction"
brew "djvu2pdf"
brew "dos2unix"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "emacs"
brew "entr"
brew "webp"
brew "gd"
brew "libtool"
brew "graphviz"
brew "eralchemy"
brew "fping"
brew "fzf"
brew "gauche"
brew "geoip"
brew "libyaml"
brew "gerbil-scheme"
brew "gforth"
brew "git"
brew "git-lfs"
brew "gitlab-gem"
brew "gitlab-runner"
brew "libsigsegv"
brew "gnu-smalltalk"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gotags"
brew "ncurses"
brew "grv"
brew "gsettings-desktop-schemas"
brew "libepoxy"
brew "gtk+3"
brew "guile"
brew "helm"
brew "hping"
brew "httpie"
brew "httping"
brew "hyperspec"
brew "ifstat"
brew "intltool"
brew "iperf3"
brew "ipfs"
brew "ipython"
brew "jq"
brew "jrnl"
brew "json-c"
brew "leiningen"
brew "lft"
brew "lftp"
brew "libdnet"
brew "ruby", link: true
brew "libusb-compat"
brew "libvirt"
brew "libxml2"
brew "libxslt"
brew "lldpd"
brew "m-cli"
brew "macvim"
brew "mandoc"
brew "markdown"
brew "mas"
brew "masscan"
brew "md5deep"
brew "minicom"
brew "minimal-racket"
brew "mtr"
brew "ncdu"
brew "neon"
brew "newsboat"
brew "nfdump"
brew "nmap"
brew "packer"
brew "pandoc"
brew "paperkey"
brew "pidof"
brew "poppler"
brew "postgresql"
brew "procmail"
brew "pth"
brew "qemu"
brew "ranger"
brew "rclone"
brew "recutils"
brew "remind"
brew "ripgrep"
brew "rsync"
brew "scheme48"
brew "sf-pwgen"
brew "sipcalc"
brew "smartmontools"
brew "smartypants"
brew "sshfs"
brew "sshuttle"
brew "sslscan"
brew "stunnel"
brew "tcl-tk"
brew "tcping"
brew "tcptraceroute"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc"
brew "vimpager"
brew "w3m"
brew "watch"
brew "weechat"
brew "wget"
brew "wiki"
brew "wireshark", link: false
brew "wxmac"
brew "yadm"
brew "saulpw/vd/visidata"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "cyberduck"
cask "dash"
cask "docker"
cask "flotato"
cask "font-iosevka"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "handbrake"
cask "inkscape"
cask "java"
cask "love"
cask "macdown"
cask "manopen"
cask "meld"
cask "nvalt"
cask "openemu"
cask "parallels"
cask "parallels-virtualization-sdk"
cask "pd"
cask "ripcord"
cask "skype"
cask "spotify"
cask "steam"
cask "sunvox"
cask "tigervnc-viewer"
cask "tor-browser"
cask "transmission"
cask "vagrant"
cask "vcv-rack"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xscreensaver"
cask "yujitach-menumeters"
mas "1Password 7", id: 1333542190
mas "Calca", id: 635758264
mas "Ghostery Lite", id: 1436953057
mas "Graphic", id: 404705039
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "OP-Z", id: 1098190457
mas "Oscilloppoi", id: 1102313524
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Tomato One", id: 907364780
mas "WiFi Explorer", id: 494803304
