tap "2mol/tools"
tap "akeylesslabs/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# OpenType text shaping engine
brew "harfbuzz"
# Flexible lightweight test report tool
brew "allure"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Security-oriented static analyser for Python code
brew "bandit"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Language Server for Bash
brew "bash-language-server"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Strongly specified, highly compatible implementation of Markdown
brew "cmark"
# High performance code minimap generator
brew "code-minimap"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Monitor DHCP traffic for debugging purposes
brew "dhcpdump"
# GNU diction and style
brew "diction"
# Tool for exploring each layer in a docker image
brew "dive"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# Run arbitrary commands when files change
brew "entr"
# AST-based pattern checker for JavaScript
brew "eslint"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tag generator for Go, compatible with ctags
brew "gotags"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Convert HCL2 to JSON
brew "hcl2json"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Layer Four Traceroute (LFT), an advanced traceroute tool
brew "lft"
# Sophisticated file transfer program
brew "lftp"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Language Server for the Lua language
brew "lua-language-server"
# Swiss Army Knife for macOS
brew "m-cli"
# GUI for vim, made for macOS
brew "macvim", link: false
# UNIX manpage compiler toolset
brew "mandoc"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Recursively compute digests on files/directories
brew "md5deep"
# Terminal-based visual file manager
brew "midnight-commander"
# Minify and secure Docker images
brew "mintoolkit"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client@8.4"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql@8.4"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@15", link: true
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# It's not just a linter that annoys you!
brew "pylint"
# Static type checker for Python
brew "pyright"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Tools to work with human-editable, plain text data files
brew "recutils"
# Persistent key-value database, with built-in net interface
brew "redis"
# Sophisticated calendar and alarm
brew "remind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Typography prettifier
brew "smartypants"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# SSL tunneling program
brew "stunnel"
# TCP connect to the given IP/port combo
brew "tcping"
# Replay saved tcpdump files at arbitrary speeds
brew "tcpreplay"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terraform Language Server
brew "terraform-ls"
# Language Server Protocol for Terraform
brew "terraform-lsp"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Use ViM as PAGER
brew "vimpager"
# Vim script Language Lint
brew "vint"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# Formatter for python code
brew "yapf"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Akeyless CLI
brew "akeylesslabs/tap/akeyless"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Anthropic's official Claude AI desktop app
cask "claude"
# API documentation browser and code snippet manager
cask "dash"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
# Notes manager
cask "fsnotes"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Java IDE by JetBrains
cask "intellij-idea"
# Discover, download, and run local LLMs
cask "lm-studio"
# Screen and video recording software
cask "loom"
# Text editor
cask "macvim-app"
# Visual diff and merge tool
cask "meld"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Multimedia player
cask "vlc"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Screen savers
cask "xscreensaver"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Exporter", id: 1099120373
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Save to Reader", id: 1640236961
mas "Slack", id: 803453959
mas "Tomato 2", id: 1494210770
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
