tap "2mol/tools"
tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
tap "universal-ctags/universal-ctags"
brew "act"
brew "adns"
brew "fribidi"
brew "gdk-pixbuf"
brew "gobject-introspection"
brew "graphite2"
brew "harfbuzz"
brew "librsvg"
brew "adwaita-icon-theme"
brew "alpine"
brew "openjdk"
brew "ant"
brew "webp"
brew "libnet"
brew "arping"
brew "boost"
brew "source-highlight"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "awscli"
brew "byacc"
brew "cask"
brew "ccat"
brew "cdpr"
brew "dialog"
brew "certbot"
brew "chezscheme"
brew "chicken"
brew "rlwrap"
brew "clojure"
brew "clozure-cl"
brew "cmake"
brew "cmark"
brew "code-minimap"
brew "dbus"
brew "dhcpdump"
brew "diction"
brew "djvu2pdf"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "docutils"
brew "dos2unix"
brew "entr"
brew "gd"
brew "graphviz"
brew "eralchemy"
brew "flyway"
brew "fping"
brew "fzf"
brew "gauche"
brew "geckodriver"
brew "geoip"
brew "gerbil-scheme"
brew "gforth"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitlab-gem"
brew "gitlab-runner"
brew "libsigsegv"
brew "gnu-smalltalk"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gotags"
brew "gsettings-desktop-schemas"
brew "libepoxy"
brew "gtk+3"
brew "helm"
brew "hping"
brew "httpie"
brew "httping"
brew "hyperspec"
brew "ifstat"
brew "intltool"
brew "iperf3"
brew "ipfs"
brew "ipython"
brew "jq"
brew "jrnl"
brew "json-c"
brew "kind"
brew "leiningen"
brew "lft"
brew "lftp"
brew "libcroco"
brew "libdnet"
brew "libusb-compat"
brew "libvirt"
brew "libxslt"
brew "lldpd"
brew "luarocks"
brew "m-cli"
brew "macvim", link: false
brew "mandoc"
brew "markdown"
brew "mas"
brew "masscan"
brew "maven"
brew "md5deep"
brew "minetest"
brew "minicom"
brew "minimal-racket"
brew "mtr"
brew "protobuf"
brew "mysql"
brew "mysql-client"
brew "ncdu"
brew "neon"
brew "node"
brew "newman"
brew "newsboat"
brew "nfdump"
brew "nginx"
brew "nmap"
brew "nomad"
brew "openjdk@11"
brew "packer"
brew "pandoc"
brew "paperkey"
brew "pidof"
brew "plantuml"
brew "poetry"
brew "qt"
brew "poppler"
brew "postgresql"
brew "prettier"
brew "procmail"
brew "pth"
brew "python@3.8"
brew "qemu"
brew "r"
brew "ranger"
brew "rclone"
brew "recutils"
brew "remind"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "scheme48"
brew "sf-pwgen"
brew "shellcheck"
brew "shfmt"
brew "sipcalc"
brew "smartmontools"
brew "smartypants"
brew "sshuttle"
brew "sslscan"
brew "stunnel"
brew "tcping"
brew "tcptraceroute"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc"
brew "vimpager"
brew "w3m"
brew "watch"
brew "weechat"
brew "wget"
brew "wiki"
brew "wireshark", link: false
brew "wxwidgets"
brew "xsv"
brew "yadm"
brew "youtube-dl"
brew "2mol/tools/pboy"
brew "saulpw/vd/visidata"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "calibre"
cask "chromedriver"
cask "cyberduck"
cask "dash"
cask "devdocs"
cask "docker"
cask "drawio"
cask "firefox"
cask "flotato"
cask "font-3270"
cask "font-iosevka"
cask "fsnotes"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "handbrake"
cask "inkscape"
cask "intellij-idea"
cask "linear-linear"
cask "love"
cask "macdown"
cask "macvim"
cask "mailtrackerblocker"
cask "meld"
cask "menumeters"
cask "mesasqlite"
cask "mymonero"
cask "notion"
cask "nvalt"
cask "openemu"
cask "parallels"
cask "parallels-virtualization-sdk"
cask "pd"
cask "pgadmin4"
cask "ripcord"
cask "sequel-ace"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "sunvox"
cask "temurin8"
cask "tigervnc-viewer"
cask "tor-browser"
cask "transmission"
cask "vagrant"
cask "vcv-rack"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xquartz"
cask "xscreensaver"
cask "yujitach-menumeters"
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Calca", id: 635758264
mas "Exporter", id: 1099120373
mas "GarageBand", id: 682658836
mas "Ghostery Lite", id: 1436953057
mas "Graphic", id: 404705039
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "OP-Z", id: 1098190457
mas "Oscilloppoi", id: 1102313524
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Tomato One", id: 907364780
mas "WiFi Explorer", id: 494803304
